07_archived_old_versions/balloonFillSteady_v2/balloonFillSteady_v2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: balloonFillSteady_v1
   \    /   O peration     | 2D fixed-geometry cylinder-neck-balloon model
    \  /    A nd           |
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// --------------------------------------------------------------------------- //

scale 1;

vertices
(
    (0 -0.15 0)
    (0 -0.15 0.005)
    (0 -0.025 0)
    (0 -0.025 0.005)
    (0 -0.0025 0)
    (0 -0.0025 0.005)
    (0 0.0025 0)
    (0 0.0025 0.005)
    (0 0.025 0)
    (0 0.025 0.005)
    (0 0.15 0)
    (0 0.15 0.005)
    (0.05 -0.15 0)
    (0.05 -0.15 0.005)
    (0.05 -0.025 0)
    (0.05 -0.025 0.005)
    (0.05 -0.0025 0)
    (0.05 -0.0025 0.005)
    (0.05 0.0025 0)
    (0.05 0.0025 0.005)
    (0.05 0.025 0)
    (0.05 0.025 0.005)
    (0.05 0.15 0)
    (0.05 0.15 0.005)
    (0.1 -0.15 0)
    (0.1 -0.15 0.005)
    (0.1 -0.025 0)
    (0.1 -0.025 0.005)
    (0.1 -0.0025 0)
    (0.1 -0.0025 0.005)
    (0.1 0.0025 0)
    (0.1 0.0025 0.005)
    (0.1 0.025 0)
    (0.1 0.025 0.005)
    (0.1 0.15 0)
    (0.1 0.15 0.005)
    (0.4 -0.15 0)
    (0.4 -0.15 0.005)
    (0.4 -0.025 0)
    (0.4 -0.025 0.005)
    (0.4 -0.0025 0)
    (0.4 -0.0025 0.005)
    (0.4 0.0025 0)
    (0.4 0.0025 0.005)
    (0.4 0.025 0)
    (0.4 0.025 0.005)
    (0.4 0.15 0)
    (0.4 0.15 0.005)
);

blocks
(
    hex (2 14 16 4 3 15 17 5) (20 10 1) simpleGrading (1 1 1)
    hex (4 16 18 6 5 17 19 7) (20 8 1) simpleGrading (1 1 1)
    hex (6 18 20 8 7 19 21 9) (20 10 1) simpleGrading (1 1 1)
    hex (16 28 30 18 17 29 31 19) (40 8 1) simpleGrading (1 1 1)
    hex (24 36 38 26 25 37 39 27) (80 20 1) simpleGrading (1 1 1)
    hex (26 38 40 28 27 39 41 29) (80 10 1) simpleGrading (1 1 1)
    hex (28 40 42 30 29 41 43 31) (80 8 1) simpleGrading (1 1 1)
    hex (30 42 44 32 31 43 45 33) (80 10 1) simpleGrading (1 1 1)
    hex (32 44 46 34 33 45 47 35) (80 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (2 4 5 3)
            (4 6 7 5)
            (6 8 9 7)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (36 37 39 38)
            (38 39 41 40)
            (40 41 43 42)
            (42 43 45 44)
            (44 45 47 46)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (14 15 17 16)
            (2 3 15 14)
            (18 19 21 20)
            (8 20 21 9)
            (16 17 29 28)
            (18 30 31 19)
            (24 26 27 25)
            (24 25 37 36)
            (26 28 29 27)
            (30 32 33 31)
            (32 34 35 33)
            (34 46 47 35)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (2 14 16 4)
            (3 5 17 15)
            (4 16 18 6)
            (5 7 19 17)
            (6 18 20 8)
            (7 9 21 19)
            (16 28 30 18)
            (17 19 31 29)
            (24 36 38 26)
            (25 27 39 37)
            (26 38 40 28)
            (27 29 41 39)
            (28 40 42 30)
            (29 31 43 41)
            (30 42 44 32)
            (31 33 45 43)
            (32 44 46 34)
            (33 35 47 45)
        );
    }
);

mergePatchPairs
(
);
